#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если (НЕ Параметры.Свойство("Рекурсия")
		И Параметры.Отбор.Свойство("Владелец") 
		И ТипЗнч(Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Номенклатура")) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Номенклатура = Параметры.Отбор.Владелец;
		Параметры.Вставить("Рекурсия");
		
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		
		Если (ЗначениеЗаполнено(Параметры.Отбор.Владелец)) Тогда
			// добавим ед. хранения
			ПредставлениеЕдиницыИзмерения = Строка(Номенклатура.ЕдиницаИзмерения.Наименование) + " (ед. хранения)";
			СтандартныйСписок.Вставить(0, Номенклатура.ЕдиницаИзмерения, Новый ФорматированнаяСтрока(ПредставлениеЕдиницыИзмерения, Новый Шрифт(,,Истина)));
		КонецЕсли;
		
		ДанныеВыбора = СтандартныйСписок;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
