#Область ОбработкаТабличнойЧасти

	// Рассчитывает суммы в строке для табличной части
	//
	// Параметры:
	//  СтрокаТабличнойЧасти  - Строка таб. части - строка табличной части
	//                 <продолжение описания параметра>
	//
	Процедура РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти) Экспорт
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		РассчитатьСуммуНДСВсего(СтрокаТабличнойЧасти);
	КонецПроцедуры // РассчитатьСуммыВСтрокеТЧ()

	
	// Рассчитывает сумму НДС
	//
	// Параметры:
	//  СтрокаТабЧасти  - СтрокаТабличнойЧасти - 
	//                 <продолжение описания параметра>
	//
	// Возвращаемое значение:
	//   <Тип.Вид>   - <описание возвращаемого значения>
	//
	Функция РассчитатьСуммуНДСВсего(СтрокаТабЧасти)
		СтавкаНДС = УправлениеТорговлейСервер.ПолучитьЗначениеСтавкиНДС(СтрокаТабЧасти.СтавкаНДС);
		СтрокаТабЧасти.СуммаНДС = СтрокаТабЧасти.Сумма - (СтрокаТабЧасти.Сумма / ((СтавкаНДС + 100) / 100));
		СтрокаТабЧасти.Всего = СтрокаТабЧасти.Сумма;
	КонецФункции // РассчитатьСуммуНДСВсего()
	
#КонецОбласти