#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеТорговлейСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	Документы.ПриходнаяНакладная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	УправлениеТорговлейСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти