#Область ОбработчикиСобытийФормы
	// Код процедур и функций
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
	// Код процедур и функций
#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

	&НаКлиенте
	Процедура ЗапасыНоменклатураПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");
	КонецПроцедуры

	
	&НаКлиенте
	Процедура ЗапасыКоличествоПриИзменении(Элемент)
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ЗапасыЦенаПриИзменении(Элемент)
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");
	КонецПроцедуры
	
#КонецОбласти



#Область ОбработчикиКомандФормы
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

	// Рассчитывает сумму в строке табичной части
	//
	// Параметры:
	//  ИмяТабЧасти  - Строка - название табличной части
	//
	&НаКлиенте
	Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТабЧасти, СтрокаТабЧасти = Неопределено)
		Если (СтрокаТабЧасти = Неопределено) Тогда
			СтрокаТабЧасти = Элементы[ИмяТабЧасти].ТекущиеДанные;
		КонецЕсли;
		СтрокаТабЧасти = Элементы.Запасы.ТекущиеДанные;
		УправлениеТорговлейКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабЧасти);
	КонецПроцедуры // ПересчетСтрокиЗапасов2()


	// Получает данные номенклатуры
	//
	// Параметры:
	//  СтруктураДанные  - Соответствие - ключ и значение
	//
	// Возвращаемое значение:
	//  Соответствие   - ключ и значение
	//
	&НаСервереБезКонтекста
	Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
		Возврат СтруктураДанные;
	КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

#КонецОбласти